# 알고리즘
# 주어진 문제를 해결하기 위한 일련의 명확한 단계와 절차를 의미한다.
# 즉 어떤 입력을 받아 처리하여 원하는 출력을 생성하기 위한, 계산이나 데이터 처리 작업
# 알고리즘의 효율성은 실행 시간과 소모되는 자원 양으로 측정한다.

# 자료구조
# 자료 구조는 데이터를 효율적으로 접근하고 수정할 수 있도록 조직화, 관리, 저장하기 위한 방법이다
# 데이터를 표현하고 조작하는 데 필요한 것으로써 삽입, 수정, 삭제, 검색, 정렬, 병합 및 순회와 같은 기본적인 연산을 지원한다.

# 추상 자료형
# 추상 자료형은 데이터의 유형과 그 데이터를 조작할 수 있는 연산을 정의하지만, 
# 이러한 데이터가 실제로 어떻게 구현되는지는 보여주지 않는다.
# ADT는 데이터의 논리적 구조를 제공하며, 구현 세부 사항은 숨긴다. 정보 은닉과 모듈성의 핵심 개념이다.

# 자료 구조의 분류
# 선형 자료 구조: 데이터를 일렬로 나열한 자료 구조이다. 예를 들면, 배열, 연결 리스트, 스택, 큐가 있다. 
# 비선형 자료 구조: 데이터를 순서에 관계없이 계층 구조나 그래프 구조로 연결하는 자료구조이다. 예를 들면 트리, 그래프가 있다.